/*
  Localizable.strings
  Patched Sur
  
  Greek (el)
  Created by manthos03 5/2/21
*/

// MARK: Pre-Install App (96)
// Generic

"GET-STARTED" = "Ξεκινήστε";
"CONTINUE" = "Συνέχεια";
"GO-BACK" = "Πίσω";
"Cancel" = "Ακύρωση";
"BROWSE" = "Ψάξτε";
"REFRESH" = "Ανανέωση";
"CONTINUE-ERASE" = "Συνέχεια και Εκκαθάριση";
"REQUEST-ROOT" = "Ζητήστε Άδεια Root";
"EXTRACT-PACKAGE" = "Εξαγωγή Πακέτου";
"FINISHED" = "Τέλος";

// Enter Password Prompt
"B-ENTER-PASS-CHANGES" = "Το Patched Sur θα ήθελε να κάνει αλλαγές.";
"B-ENTER-PASS-ALLOW" = "Εισάγετε τον κωδικό σας για να το επιτρέψετε.";
// The main difference here is
"B-EP-USERNAME" = "Όνομα Χρήστη:";
// The only difference here is the colon, which sounds dumb, but it's needed.
"B-EP-PASSWORD" = "Συνθηματικό:";
"B-EP-PASSWORD-PH" = "Συνθηματικό";

// Welcome Page

// Reminder! "Patched Sur" is a formal name, so don't localize that. (Patches/Patcher can be localized, just not Patched Sur)
"PRE-WELCOME-TITLE" = "Καλωσορίσατε στο Patched Sur!";
"PRE-WELCOME-DESCRIPTION" = "Αυτό το patcher έχει φτιαχτεί για να σας παρέχει την πιο εύκολη διαδικασία ενημέρωσης στο macOS Big Sur για τον μη υποστηριζόμενο Mac σας. Αυτό το patcher προετιμάζει τα πάντα για να λειτουργούν άψογα αφού τελειώσετε την εγκατάσταση, και σιγουρεύται οτι όλα θα λειτουργήσουν ομαλά κατά την διάρκεια της εγκατάστασης.";

// Thanks To Page

"THANKS-TITLE" = "Ευχαριστίες σε";
"THANKS-CONTENT" = "Το Patched Sur δεν φτιάχτηκε μόνο απο εμένα (Ben), αρκετοί άλλοι άνθρωποι έχουν συνεισφέρει στο patcher και τα patches που το έκαναν αυτό που είναι σήμερα!

- barrykn: Έφτιαξε το micropatcher που με εισήγαγε στην διαδικασία του patching και επανέφερε την πίστη μου στον παλιό μου υπολογιστή. Είμαι ευγνώμων στον barrykn, και θα έπρεπε να είστε και εσείς.
- ASentientBot: Έφτιαξε τα Hax patches για τον installer και προσέφερε το GeForce Tesla (9400M/320M) framebuffer για το Big Sur μαζί με τα patches για την επιτάχυνση μη Metal γραφικών.
- jackluke: Κατάφερε να προσπεράσει τους ελέγχους για την συμβατότητα στο USB εγκατάστασης.
- highvoltage12v: Έφτιαξε τα πρώτα kext για το WiFi που χρησιμοποιήθηκαν στο macOS Big Sur.
- ParrotGeek: Ανέπτυξε το kext για το LegacyUSBInjector έτσι ώστε να λειτουγήσουν οι θύρες USB σε παλαιότερους Mac, και κατάφερε να βρεί τρόπο για να προσπεράσει τις εντολές του terminal όταν ανοίγει η εφαρμογή εγκατάστασης στο USB.
- testheit: Βοήθησε με την εντολή kmutil στον micropatcher (χρησιμοποιείται επίσης στο Patched Sur)
- Ausdauersportler: Ενσωμάτωσε patches για την υποστήριξη Metal καρτών γραφικών (GPU) για τους iMac.
- StarPlayrX: Πρόσεξε και ανέφερε το startosinstall το οποίο χρησημοποιήθηκε αργότερα στο patcher για να επιτραπεί η ενημέρωση του macOS χωρίς την χρήση USB.
- ASentientHedgehog: Βοήθησε σε διάφορα κατα την δημιουργία του patcher.
- OCLP Team: Βοήθησε με πράγματα σε επίπεδο kernel για μη Tesla κάρτες έτσι ώστε να έχουν επιτάχυνση γραφικών χωρίς Metal.
- dosdude1: Εναλλαγή OpenGL/GPUSupport και βεβαίως αρκετά πράγματα σχετικά με patching που χρησημοποιήθηκαν στο patcher.
- Οι Bweesh, Bruno Rocha, DutchDK, NickP0is0n, 8itCat, Finder352, DJT_233, Noah Fetz, duke4e, riiveraluis, και manthos03 βοήθησαν για την μετάφραση της εφαρμογής.
- Οι John_val, fromeister2009, Mr. Macintosh, Emperor Epitaph, Finder352, Monkiey και 8itCat βοήθησαν στον έλεγχο διαφόρων χαρακτηριστικών πριν την κυκλοφορία, και βρήκαν τα bug τους.
- Και άλλοι που βοήθησαν στο να λειτουργεί τόσο καλα το Big Sur σε μη υποστηριζόμενους Mac.

Το Patched Sur επίσης χρησημοποιεί Open Source πλαίσια, με τα Files και ShellOut από τον JohnSundell (Άδεια ΜΙΤ), που βοήθησαν στην διαχείρηση συγκεκριμένων έργων.";

// Please Remember Page

"PLEASE-REMEMBER" = "Παρακαλώ κρατήστε στο νου σας";
"PRE-PR-1" = "Το Patched Sur είναι σε beta στάδιο και δεν θα είναι ποτέ τέλειο. Παρ'ότι δεν θα καταστρέψει τον Mac σας, μπορεί να προκαλέσει χάσιμο δεδομένων αν δεν έχετε αντίγραφο ασφαλείας.";
"PRE-PR-2" = " Σε κάθε περίπτωση, πραγματοποιείστε αντίγραφο Time Machine πριν κάνετε ενημέρωση. ";
"PRE-PR-3" = "Εγώ (και αυτοί που έχουν συνεισφέρει) δεν θα είναι υπέυθυνοι αν κάτι πάει στραβά. Θα προσπαθήσω στο έπαρκο των δυνατοτήτων μου να βοηθήσω αν υπάρξει πρόβλημα, αλλά δεν ξέρω τα πάντα και υπάρχουν μερικές περιπτώσεις όπου δεν μπορώ να βοηθήσω. Πολλές φορές το πρόβλημα δεν ευθύνεται στο Patched Sur, οπότε δεν υπάρχει κάτι που να μπορώ να κάνω.";

// Mac Compatibility Page

"PRE-VERIFY-MAC" = "Επιβεβαίωση Mac";
"PRE-VERIFY-QUICK" = "Το πρώτο βήμα είναι απαραίτητο για το πόσο αξιόπιστο είναι το Patched Sur. Σε αυτό το βήμα γίνεται προσπάθεια εντοπισμού όσων περισσότερων προβλημάτων γίνεται πριν αντιμετωπιστούν. Αυτό περιλαμβάνει το FileVault, την έλλειψη επιτάχυνσης γραφικών και κάποια άλλα προβλήματα. Μην ανησυχείτε, θα πάρει μόνο λίγη ώρα.";
"PRE-VERIFY-FETCH" = "Μάζεμα Πληροφοριών";
"PRE-VERIFY-2" = "Επαλήθευση του Mac";

"PRE-REPORT-BY" = "Αναφέρθηκε απο: ";
"PERSON" = "άνθρωπος";
"OTHERS" = "άλλοι";
"APPROVES" = "εγκρίνει";
"APPROVE" = "έγκριση";

"WiFi, Ethernet and Bluetooth" = "WiFi, Ethernet και Bluetooth";
"I/O Ports" = "Θύρες Ι/Ο";
"Graphics Acceleration" = "Επιτάχυνση Γραφικών";
"Sleep and Brightness" = "Ύπνος και Φωτεινότητα";
"FileVault" = "FileVault";
"Personal Hotspots" = "Προσωπικά Hotspots";
"Personal Hotspot" = "Προσωπικό Hotspot";
"WPA2 Enterprise" = "WPA2 Επαγγελματικό";

"PROB-FATAL" = "Ανιχνεύθηκε Θανάσημο Πρόβλημα";
"PROB-WARN" = "Ανιχνεύθηκε Πιθανό Πρόβλημα";
"PROB-NO-UPGRADE" = "Δεν μπορείτε να ενημερώσετε στο Big Sur λόγω αυτού ή άλλων προβλημάτων.";
"PROB-CONTINUE-ANYWAY" = "Συνέχεια έτσι και αλλιώς ";
"PROB-OTHERS" = "Άλλα Προβλήματα";

"PROB-FILE-TITLE" = "Το FileVault είναι ενεργό.";
"PROB-FILE-DESCRIPTION" = "Ο Mac σας έχει ενεργό το FileVault. Παρ'ότι αυτό είναι καλό εργαλείο κρυπτογράφησης, δεν λειτουργεί στο Big Sur σε μη υποστηριζόμενους Mac. Δεν θα μπορείτε να ξεκινήσετε και να χρησημοποιείσετε τον τόμεα που είναι για την επαναφορά του δίσκου σας , και αρκετές φορές δεν θα μπορείτε να ξεκλειδώσετε τον δίσκο σας. Πρέπει λοιπόν να απενεργοποιείσετε το FireVaut πριν ξεκινήσετε το patcher. Μπορείτε να το απενεργοποιείσετε πηγαίνοντας στις Προτιμήσεις Συστήματος, πατώντας Ασφάλεια & Απόρρητο, FileVault, πατώντας στην κλειδαριά και απενεργοποιώντας το.";

// Reminder! "BigMac" and "StarPlayrX" are a formal names, so don't localize that.
"PROB-PRO-TITLE" = "Υπάρχει καλύτερος Patcher για τους Mac Pro";
"PROB-PRO-DESCRIPTION" = "Παρ'ότι το Patched Sur λειτουργεί πολύ καλά με αρκετούς Mac, οι Mac Pro δεν θα έπρεπε να χρησιμοποιούν αυτο το patcher. Δεν έχουν τα κατάλληλα patches, και υπάρχει άλλο, πιο εύκολο στην χρήση patcher σχεδιασμένο ειδικά για τους Mac Pro. Είναι το BigMac Patcher του StarPlayrX , και θα κάνει την εμπειρία του Mac σας πολύ καλύτερη.";

"PROB-GX-TITLE" = "Καμία Επιτάχυνση Γραφικών";
"PROB-GX-DESCRIPTION" = "Ο Mac σας δεν υποστηρίζει την επιτάχυνση Metal γραφικών, οπότε το Big Sur θα είναι ΠΟΛΥ ΑΡΓΟ. Μην περιμένετε να είναι γρήγορο και να λειτουργεί καλά. Δεν μποείτε να το φτιάξετε και ενώ ένα patch είναι στο στάδιο ανάπτυξης για να το διορθώσει, στην τωρινή του κατάσταση ειναι πολυ ασταθές. Μπορείτε να συνεχίσετε αν θέλετε, αλλά μην περιμένετε την πλήρη εμπειρία του Big Sur.";

"PROB-SURE" = "Είστε σίγουροι ότι θέλετε να συνεχίσετε?";
"PROB-SURE-SURE" = "Το Patched Sur ανίχνευσε προβλήματα που μπορεί να προκαλέσουν (σχεδόν σίγουρα) θέματα στο Big Sur. Ο Mac σας μπορεί να μην λειτουργήσει στις πλήρης ικανότητες του, και σε κάποιες περιπτώσεις ίσως είναι καλύτερο να μείνετε στην έκδοση Catalina.";

"REPORT-UNKNOWN" = "Άγνωστη Συμβατότητα";
"REPORT-UNKNOWN-2" = "Ανάλογα με τον Mac σας, το Patched Sur μπορεί να λειτουργήσει μια χαρά ή όχι, λαμβάνοντας υπ'όψη ότι το Patched Sur δεν βρήκε αναφορές συμβατότητας σχετικά με τον Mac σας, οπότε δεν μπορεί αυτή την στιγμή να σας ενημερώσει σχετικά με αυτό το θέμα. Μην ανησυχήτε όμως, καθώς λίγοι είναι αυτοί που έχουν ελέγξει πόσο καλά λειτουργεί το Patched Sur σε όλους τους διαφορετικούς Mac, οπότε κατά πάσα πιθανότητα ο Mac σας θα λειτουργήσει μια χαρά. Μόλις ολοκληρώσετε την ενημέρωση, μπορείτε να συνεισφέρετε τις εμπειρίες σας (πηγαίνοντας στις Ρυθμίσεις της εφαρμογής post-install), και να βοηθήσετε ανθρώπους με τον Mac σας στο μέλλον!";

// Update Track Page

"PRE-TRACK-TITLE" = "Θέστε Είδος Ενημέρωσης";
"PRE-TRACK-DESCRIPTION" = "Το είδος ενημέρωσης ορίζει τι είδος του macOS θα λαμβάνετε. Η έκδοση επίσημης Κυκλοφορίας (Release) είναι η πιο σταθερή, και πιθανότατα αυτή που χρησιμοποιείτε ήδη. Η έκδοση Beta σας δίνει πρόσβαση σε νέα χαρακτηριστικά του macOS πιο νωρίς, αλλά μπορεί να μην είναι τόσο σταθερή.";

"TRACK-RELEASE" = "Κυκλοφορία";
"TRACK-BETA" = "Beta";

// macOS Select Page

"PRE-VERS-TITLE" = "Έκδοση macOS Big Sur";
"PRE-VERS-DESCRIPTION" = "Παρ'ότι τις περισσότερες φορές θα θέλετε την πιο πρόσφατη έκδοση του macOS Big Sur, μπορεί για τον οποιοδήποτε λόγο να θέλετε μια πιο παλιά, και μπορείτε να την διαλέξετε εδώ. Αν θέλετε να χρησιμοποιήσετε ένα ήδη κατεβασμένο InstallAssistant.pkg ή μια εφαρμογή εγκατάστασης, μπορείτε πατώντας το κουμπί \"Ψάξτε\". Αν θέλετε απλώς να κατεβάσετε και να χρησιμοποιήσετε την πιο πρόσφατη έκδοση, πατήστε \"Κατέβασμα\".";
"PRE-VERS-NOFI" = "Η λίστα διαθέσιμων εργαλείων εγκατάστασης του macOS Big Sur δεν μπορούσε να προσπελαστεί. Αυτό ίσως ευθύνεται στο γεγονός ότι δεν είναι διαθέσιμο το WiFi. Πρέπει να χρησιμοποιήσετε ενα ήδη κατεβασμένο εργαλείο εγκατάστασης του macOS Big Sur.";
// NOTE: In these two, XX.YY.ZZ is the macOS version. So in English, the first would show Download macOS 11.3. \(installers[0].version)
"PRE-VERS-DOWNLOAD" = "Κατέβασμα macOS XX.YY.ZZ";
"PRE-VERS-USE" = "Χρησιμοποιείστε το macOS XX.YY.ZZ";
"PRE-VERS-PRE" = "Χρησιμοποιείστε ένα ήδη κατεβασμένο macOS";
"PRE-VERS-REDOWNLOAD" = "Επανακατέβασμα";
"PRE-VERS-FETCH" = "Εύρεση Εργαλείων Εγκατάστασης";

// Downloading Kexts Page

"DOWNLOAD-PATCHES" = "Κατέβασμα των Patches";
"DOWNLOAD-FILES" = "Κατέβασμα Αρχείων";
"PRE-DP-1" = "Το εργαλείο set vars σας επιτρέπει να διαμορφώσετε ορθώς την NVRAM και την κατάσταση του SIP, ώστε να μπορείτε να ξεκινήσετε στο Big Sur.";
"PRE-DP-2" = "Αυτό είναι το τελευταίο εργαλείο που θα χρησιμοποιήσετε πριν την εγκατάσταση του Big Sur.";
"PRE-DP-3" = "Θα το χρειαστείτε μόνο αν δεν το έχετε χρησιμοποιήσει σε αυτόν τον Mac προηγουμένως ή αν επαναφέρατε την PRAM.";
"PRE-DP-4" = "Τα kext patches σας επιτρέπουν να χρησιμοποιήσετε υλικό όπως το WiFi και οι θύρες USB, ώστε ο Mac σας να διατηρήσει την πλήρη λειτουργηκότητα του.";
"PRE-DP-CANCEL-1" = "Τα patches που θα χρησιμοποιηθούν αργότερα απο το patcher κατεβαίνουν τώρα. Είστε σίγουροι πως θέλετε να γυρίσετε πίσω?";
"PRE-DP-CANCEL-2" = "Τα Patches κατεβαίνουν";
"CANCEL-DOWNLOAD" = "Ακύρωση Κατεβάσματος";
"RESTART-DOWNLOAD" = "Επανεκκίνηση Κατεβάσματος";
"CONTINUE-DOWNLOAD" = "Συνέχιση Κατεβάσματος";
"PRE-DP-CANCEL-3" = "Τα patches δεν κατέβηκαν επιτυχώς, όμως μπορείτε να λύσετε αυτό το πρόβλημα δοκιμάζοντας να τα κατεβάσετε πάλι. Θέλετε να δοκιμάσετε να τα κατεβάσετε ξανά ή να πάτε στο προηγούμενο βήμα?";
"PRE-DP-CANCEL-4" = "Θέλετε να επαννεκινήσετε το κατέβασμα?";

// Downloading macOS Page

"PRE-DM-TITLE" = "Κατέβασμα macOS";
"PRE-DM-DESCRIPTION" = "Αυτή τη στιγμή, το macOS κατεβαίνει κατευθείαν απο την Apple για να τοποθετηθεί σε USB εγκατάστασης. Αυτό είναι ένα πλήρες εργαλείο εγκατάστασης, οπότε λαμβάνει 12GB χώρου. Θα πάρει αρκετή ώρα, οπότε αφήστε το και σιγουρευτείτε ότι έχετε καλή σύνδεση στο ίντερνετ. Αφού τελειώσει το κατέβασμα, θα πρέπει να διαλέξετε ενα USB  για το εργαλείο εγκατάστασης, και έπειτα το Patched Sur θα χρησιμοποιήσει αυτο το αρχείο για να δημιουσγήσει ενα USB με το εργαλείο εγκατάστασης.";
"PRE-DM-BAR" = "Κατέβασμα του macOS XX.YY.ZZ";
"PRE-DM-CANCEL-1" = "Το macOS Big Sur κατεβαίνει τώρα ώστε να χρησιμοποιηθεί αργότερα. Το κατέβασμα είναι μεγάλο. Είστε σίγουροι ότι θέλετε να πάτε πισω?";
"PRE-DM-CANCEL-2" = "Το macOS κατεβαίνει";
"PRE-DM-CANCEL-3" = "Το macOS απέτυχε να κατέβει, όμως μπορείτε να λύσετε αυτό το πρόβλημα δοκιμάζοντας να το κατεβάσετε πάλι. Θέλετε να δοκιμάσετε να κατεβάσετε το macOS ξανά ή να πάτε στο προηγούμενο βήμα?";

// Select Volume Page

"PRE-VOL-TITLE" = "Διαλέξτε έναν δίσκο USB";
"PRE-VOL-1" = "Για να εγκαταστήσετε αρχικά το macOS Big Sur, θα χρειαστείτε ένα εργαλείο εγκατάστασης σε USB. Αυτό σας προμηθεύει με ένα περιβάλλον στο οποίο ο patcher μπορεί να σιγουρευτεί ότι όλα θα πάνε σωστά.";
"PRE-VOL-2" = "Για να δημιουργήσετε ενα εργαλείο εγκατάστασης, χρειάζεστε έναν δίσκο στον οποίο θα τοποθετηθεί.";
"PRE-VOL-3" = "Αυτό το USB πρέπει να είναι ίσο ή μεγαλύτερο των 16GB. Εσωτερικοί τόμοι (partitions) δεν λειτουργούν, αλλά οι εξωτερικοί λειτουργούν αναλόγως με την μορφή τους (partition map) (που μάλλον θα είναι σωστή με την την μορφή GUID). Αν δεν εμφανιστεί ο δίσκος σας, σιγουρευτείτε οτι έχει διαμορφωθεί ως MacOS Extended (Journaled).";
"PRE-VOL-NO" = "Κανένας συμβατός δίσκος δεν βρέθηκε.";
// Note: VOLUME is the volume name, do not localize it, just pretend it's a volume name and just place it into your sentence
// Ex. If the volume was "SuperDrive", then "VOLUME will be erased." would show up as "SuperDrive will be erased."
"PRE-VOL-ERASED" = "VOLUME θα σβηστεί.";
"PRE-VOL-ERASED-2" = "Όλα τα αρχεία σε αυτόν τον δίσκο θα σβηστούν. Αυτή η επιλογή είναι μη αντιστρέψιμη. Είστε σίγουροι ότι θέλετε να συνεχίσετε?";
"PRE-VOL-DETECTING" = "Εύρεση Δίσκων";
"PRE-VOL-CHECKING" = "Έλεγχος VOLUME";

// Create Installer Page

"PRE-CTI-TITLE" = "Δημιουργία Εργαλείου Εγκατάστασης σε USB";
"PRE-CTI-DESCRIPTION" = "Το USB που διαλέξατε χρησιμοποιείται για να δημιουργηθεί USB εγκατάστασης του macOS Big Sur. Τα αρχεία που αντιγράφηκαν στον δίσκο δημιουργούν ένα περιβάλλον που μοιάζει με την Λειτουργία Επαναφοράς του macOS Big Sur. Μόλις τοποθετηθούν αυτά τα αρχεία στο δίσκο USB, το Patched Sur αναλαμβάμει να του βάλει τα απαραίτητα patches έτσι ώστε να μπορεί να ξεκινήσει σε αυτό ο Mac σας δίνοντάς του χρήσιμα εργαλεία.";
"PRE-CTI-CANCEL-1" = "Είστε σίγουροι ότι θέλετε να ακυρώσετε την δημιουργία του εργαλείου εγκατάστασης στον δίσκο USB? Θα το χρειαστείτε για να πραγματοποιήσετε την ενημέρωση στο macOS Big Sur, και συνήθως παίρνει αρκετή ώρα.";
"PRE-CTI-CANCEL-2" = "Ενα εργαλείο εγκατάστασης macOS δημιουργείται τώρα";
"CANCEL-PROCESS" = "Ακύρωση Διαδικασίας";
"RESTART-PROCESS" = "Επανεκκίνηση Διαδικασίας";
"CONTINUE-PROCESS" = "Συνέχιση Διαδικασίας";
"PRE-CTI-CANCEL-3" = "Υπήρξε πρόβλημα κατά την δημιουργία του εργαλείου εγκατάστασης macOS στο USB, αλλά μπορείτε να δοκιμάσετε να το δημιουργήσετε ξανα για να λύσετε το πρόβλημα.";
"PRE-CTI-CANCEL-4" = "Θέλετε να δοκιμάσετε ξανά?";
"PRE-CTI-CREATING" = "Δημιουργία Εργαλείου Εγκατάστασης";

// Done Page
"PRE-DONE-INFO" = "Σχεδόν τελειώσατε την ενημέρωση στο Big Sur. Το USB με το εργαλείο εγκατάστασης δημιουργήθηκε επιτυχώς, και τώρα ήρθε η ώρα για λίγη δουλειά από εσάς. Αν δεν ακολουθείτε απευθείας τα βήματα, μπορείτε να τα γράψετε ώστε να ξέρετε τι κάνετε (τα βήματα είναι πολύ εύκολα, παρ'ότι φαίνοντα πολλά):

1. Επανεκκινήστε τον Mac σας κρατώντας πατημένο το κουμπί Option μέχρι να εμφανιστεί ο δίσκος.
2. Επιλέξτε το κίτρινο ή μωβ EFI Boot. Ο υπολογιστής σας θα σβήσει αμέσως.
3. Ανοίξτε πάλι τον Mac σας, κρατώντας πάλι πατημένο το κουμπί Option.
4. Επιλέξτε το Install macOS Big Sur.
5. Όταν ξεκινήσει ο Mac σας, επιλέξτε το (Re)Install macOS Big Sur πάλι. (Μπορεί να φανεί, αλλά δεν θα διαγραφούν τα αρχεία σας, απλά θα ενημερωθούν τα αρχεία του συστήματος σας, σαν κανονική ενημέρωση)
6. Όταν η εφαρμογή ανοίξει, ψάξτε και επιλέξτε τον κυρίως δίσκο (πιθανώς τον Macintosh HD, και όχι τον Install macOS Big Sur)
7. Μόλις ολοκληρωθεί η ενημέρωση και δείτε το παραθυρό εισαγωγής στον λογαριασμό σας (log in), ανοίξτε τον φάκελο των εφαμογών και ανοίξτε το Patched Sur.
8. Πατήστε το \"Patch Kexts\", πατήστε \"Continue\" και εισάγετε τον κωδικό σας.
9. Μόλις τελειώσει αυτή η διαδικασία, επανεκιννήστε τον Mac σας και απολαύστε το Big Sur!";
// I suggest adding "However, these are only in English." to the end of this, since the linked page is only in English.
"PRE-DONE-LINK" = "Μπορείτε να βρείτε αυτα τα βήματα και στο GitHub, αλλά είναι στα Αγγλικά, οπότε αν θέλετε την Ελληνική έκδοση ακολουθήστε αυτό τον οδηγό.";
"PRE-DONE-STEPS" = "(Βήματα 10-14)";

// MARK: Post-Install App (96)

// General

"BACK" = "Πίσω";
"RESTART-TO-FINISH" = "Επανεκκινείστε για Τελείωμα";

// MARK: Menu Bar

"PO-MN-ABOUT-PATCHER" = "Σχετικά με το Patched Sur";
"PREFERENCES" = "Προτιμήσεις";
"PO-AMM-TITLE" = "Σχετικά με τον Mac μου";
"PO-MN-HELP" = "Βοήθεια για το Patched Sur";
"PO-MN-HELP-OS" = "Ενημέρωση του macOS";
"PO-MN-HELP-PATCHER" = "Ενημέρωση του patcher";

// MARK: Update Notifications

// VERSIONTAG is the version number of the new patcher/macOS version (like 0.3.1 or 11.3.1).
"PO-NOFI-SELF" = "Το Patched Sur μπορεί τώρα να ενημερωθεί στην έκδοση VERSIONTAG. Ανοίξτε το Patched Sur και πατήστε Αρχή Ενημερώσεων για να μάθετε περισσότερα.";
"PO-NOFI-OS-TITLE" = "Ενημέρωση Λογισμικού";
"PO-NOFI-OS-DESCRIPTION" = "Το macOS Big Sur VERSIONTAG μπορεί τώρα να εγκατασταθεί στην συσκευή σας. Ανοίξτε το Patched Sur και πατήστε Ενημέρωση macOS για να μάθετε περισσότερα.";

// MARK: About Patched Sur

// APPBUILD is the app's version build number, like "96".
"PO-ATP-AUTHOR-BUILD" = "Από τον: Ben Sova • Έκδοση APPBUILD";
"PO-ATP-DESCRIPTION" = "Ένα απλό patcher, με έναν μεγάλο πυρήνα, που κάνει την λειτουργία του Big Sur σε μη υποστηριζόμενους Mac απλή και σχεδιασμένη για όλους.";
"PO-ATP-WHATS-NEW-QUESTION" = "Τι είναι νέο στην v0.3.0?";
"PO-ATP-WHATS-NEW-ANSWER" = "Θα είναι γρήγορο, ισχυρό και ξεκάθαρο, ακόμα και αν δεν έχετε Metal γραφικά, ή δεν μιλάτε Αγγλικά.";

// MARK: Central View

"PO-UP-TITLE" = "Αρχή Ενημερώσεων";
"PO-UP-DESCRIPTION" = "Ενημέρωση του macOS ή του patcher στην νεότερη έκδοση.";
"PO-PK-TITLE" = "Patch των Kext";
"PO-PK-DESCRIPTION" = "Τα Kexts δίνουν στο macOS την πλήρη λειτουργικότητα του, ώστε να λειτουργούν όλα όπως πρέπει.";
"PO-ST-TITLE" = "Ρυθμίσεις";
"PO-ST-DESCRIPTION" = "Απενεργοποίηση των animations, ενεργοποίηση εναλλαγής γραφικών, εμφάνιση των logs και πολλά άλλα.";
"PO-CI-TITLE" = "Δημιουργία Εγκαταστάτη";
"PO-CI-DESCRIPTION" = "Δημιουργία ενός εγκαταστάτη macOS Big Sur σε USB που μπορεί να εγκαταστείσει το macOS.";
"PO-IR-TITLE" = "Εγκατάσταση Τόμου Επαναφοράς";
"PO-IR-DESCRIPTION" = "Να γίνει Patch του τρέχοντος τόμου (με το CMD-R κατά την εκκίνηση). Δεν είναι πάντοτε χρήσιμο.";
"PO-AMM-DESCRIPTION" = "Εμφάνιση πληροφοριών για τον Mac σας χωρίς τον σειριακό αριθμό. Χρήσιμο για να επιδείξετε την επιτυχία σας.";
"PO-PK-NO-NEED-TITLE" = "Το Patch των Kexts δεν είναι αναγκαίο";
"PO-PK-NO-NEED-DESCRIPTION" = "Δεν είναι αναγκαίο το patch των kexts σε μοντέλα iMac που φτιάχτηκαν στο τέλος του 2013. Το Big Sur ήδη λειτουργεί στην πληρώτητα των δυνατοτήτων του.";

// MARK: Settings View

"PO-ST-TITLE-ALT" = "Περαιτέρω Ρυθμίσεις";
"PO-ST-SUBTITLE" = "Μερικά Χρήσιμα Εργαλεία/Patches";
"PO-ST-SECTION-1" = "Περαιτέρω Patches";
"PO-ST-SECTION-2" = "Περαιτέρω Tools";
"PO-ST-RESTART-APPLY" = "Μόλις επανεκκινήσετε τον Mac σας, θα ισχύσουν οι αλλαγές.";

"PO-ST-DA-DISABLE" = "Απενεργοποίηση Animations";
"ENABLE" = "Ενεργοποίηση";
"PO-ST-DA-DISABLE-DONE" = "Έγινε Απενεργοποίηση των Animations!";
"PO-ST-DA-DISABLE-DONE-2" = "Μόλις επανεκκινήσετε τον Mac σας, θα ισχύσουν οι αλλαγές, και το Big Sur θα πρέπει να λετουργήσει καλύτερα.";
"PO-ST-DA-ENABLE-DONE" = "Έγινε Ενεργοποίηση των Animations!";
"PO-ST-DA-DESCRIPTION" = "Η Απενεργοποίηση των Animations βοηθά τους Mac χωρίς Metal. Αφού δεν έχουν επιτάχυνση γραφικών, το Big Sur λειτουργεί πολύ αργά, οπότε η απενεργοποίηση των animations θα βοηθήσει λίγο.";

"PO-ST-GXS-ENABLE" = "Ενεργοποίηση Εναλλαγής Γραφικών";
"DISABLE" = "Απενεργοποίηση";
"PO-ST-GXS-DESCRIPTION" = "Εάν έχετε Mac με πολλαπλές GPU (κάρτες γραφικών), τότε ίσως θέλετε ενεργοποιημένη την αυτόματη εναλλαγή γραφικών. Χάρη στον @15wat βρέθηκε αυτή η λύση.";
"PO-ST-GXS-ENABLE-DONE" = "Εναλλαγή Γραφικών Ενεργοποιημένη";
"PO-ST-GXS-ENABLE-DONE-2" = "Τώρα τα γραφικά θα εναλλάσσονται αυτόματα! Ίσως χρειαστεί μία επανεκκίνηση για να ισχύσουν αυτές οι αλλαγές.";
"PO-ST-GXS-ENABLE-FAILED" = "Αποτυχία Ενεργοποίησης Εναλλαγής Γραφικών";
"PO-ST-GXS-DISABLE-DONE" = "Απενεργοποιήθηκε η Εναλλαγή Γραφικών";
"PO-ST-GXS-DISABLE-DONE-2" = "Τώρα τα γραφικά δεν θα εναλλάσονται αυτόματα! Ίσως χρειαστεί μία επανεκκίνηση για να ισχύσουν αυτές οι αλλαγές.";
"PO-ST-GXS-ENABLE-FAILED" = "Αποτυχία Απενεργοποίησης Εναλλαγής Γραφικών";

"PO-ST-PKL-BUTTON" = "Εμφάνηση των Patch Kexts Logs";
"PO-ST-PKL-DESCRIPTION" = "Αν έχετε πρόβλημα με τα Patch Kexts που δεν δουλεύουν, ίσως αξίζει να ρίξετε μια ματιά στα log μήπως εντοπίσετε κάποιο σφάλμα. Μπορείτε έτσι να δώσετε χρήσιμες πληροφορίες σε κάποιον που προσπαθεί να σας βοηθήσει, άρα αν μπορείτε να του τις δώσετε.";
"PO-ST-PKL-TITLE" = "Να γίνει Patch των Kexts Logs";
"PO-ST-PKL-NO-LOGS" = "Δεν Καταγράφηκαν Logs";
"PO-ST-PKL-COPIED" = "Αντιγράφηκαν!";
"PO-ST-PKL-COPIED-2" = "Τα τελευταία log απο το Patch Kexts έχουν αντιγραφεί στο πρόχειρο. Αυτό μπορεί να σας βοηθήσει στο debugging, και σιγουρευτείτε ότι θα τα μοιραστείτε με όποιον σας βοηθάει με κάποιο πρόβλημα που αντιμετωπίζεται.";

"PO-ST-CL-TITLE" = "Καθαρισμός απομειναριών Patched Sur";
"PO-ST-CL-DESCRIPTION" = "Μερικές φορές, το Patched Sur αφήνει απομεινάρια από προηγούμενες εργασίες. Αυτό σημαίνει ότι μπορείτε να εξοικονομήσετε εώς και 12GB αποθηκευτικού χώρου, κάτι το οποίο προτείνεται αφού τελειώσετε την χρήση του patcher.";
"PO-ST-CL-DONE" = "Καθαρίστηκαν τα απομεινάρια";
"PO-ST-CL-DONE-2" = "Τα αρχεία διαγράφτηκαν, και θα πρέπει να παρατηρήσετε ότι υπάρχει περισσότερος ελεύθερος χώρος (υποθέτοντας ότι υπήρχαν μεγάλα αρχεία για καθάρισμα).";

"PO-ST-CYE-TITLE" = "Συνεισφέρετε τις εμπειρίες σας. Προσοχή: μόνο απαντήσεις στα αγγλικά θα λαμβάνονται υπόψη.";
// Add a translation for 'Please Note: These reports are only accepted in English.' to this next value
"PO-ST-CYE-DESCRIPTION" = "Η εφαρμογή προεγκατάστασης του Patched Sur η οποία σας επιτρέπει να δείτε πόσο καλά θα αποδίδει ο Mac σας μετά την ενημέρωση στο Big Sur. Παρ’όλα αυτά, μία τέτοια λειτουργία χρειάζεται πληροφορίες, και με αυτό μπορείτε να βοηθήσετε εσείς! Απλά πατήστε τον σύνδεσμο παραπάνω και ακολουθήστε τις οδηγίες για να βοηθήσετε.";

"PO-ST-RL-TITLE" = "Επανεκκίνηση του Patcher";
"PO-ST-RL-DESCRIPTION" = "Δεν ξέρω για ποιο λόγο θα το χρειαζόσασταν αυτό, αλλά εφ’όσον είναι αναγκαίο, μπορείτε να επανεκκινήσετε την εφαρμογή. Έτσι επαναφέρεται πολλές μεταβλητές που αποκτά το patcher κατά την πρώτη εκκίνηση. Παρεμπιπτόντως: Αυτός είναι ο ίδιος κώδικας που χρησιμοποιείται όταν τελειώσει η ενημέρωση.";
"PO-ST-RL-FAILED" = "Η Επανεκκίνηση Απέτυχε!";
"PO-ST-RL-FAILED-2" = "Αποτυχία ανοίγματος του Patched Sur, αλλά αυτό μπορείτε να το κάνετε μονοί σας.";

// MARK: Patch Kexts Page

"PO-PK-TITLE-ALT" = "Κάντε Unpatch τα Kext";
"PO-PK-SUBTITLE" = "Κάντε τους Driver να λειτουργούν";
"PO-PK-DESCRIPTION-2" = "Το Patching των kexts σας, επιτρέπει την λειτουργία του Wifi, του USB, και πολλών άλλων πραγμάτων να λειτουργούν στην εγκατάσταση του Big Sur σας. Χωρίς αυτά τα kext, ο Mac σας δεν θα μπορούσε να λειτουργήσει στην πληρότητα των δυνατοτήτων του μετά την εγκατάσταση του Big Sur. Αν χρειαστεί, μπορείτε να αφαιρέσετε τα patch από τα kext, και να τα επαναφέρεται, κάτι το οποίο μπορεί να λύσει το πρόβλημα. Μερικές φορές, ίσως είναι καλή ιδέα να περιμένετε λίγη ώρα πριν επαναφέρετε τα patch για τα kext, καθώς μπορεί να υπάρχουν παρεμβολές με το αρχείο του Συστήματος.";
"PO-PK-START" = "Έναρξη του Patch των Kext";
"PO-PK-UN-START" = "Έναρξη του Unpatch των Kexts";
"PO-PK-INSTEAD" = "Να γίνει Unpatch των Kexts";
"PO-PK-INSTEAD-REVERSE" = "Patch των Kexts";
"PO-PK-DETECT" = "Διαγραφή των Patches";
"PO-PK-NONE-DETECTED" = "Πόροι για το Patch δεν βρέθηκαν.";
"PO-PK-NONE-HELP" = "Δοκιμάστε να εισάγετε ενα Patched USB εγκατάστασης";
"PO-PK-RUNNING" = "Patching των Kext";
"PO-PK-UN-RUNNING" = "Unpatching των Kext";
"PO-PK-LEGACY-ALERT" = "Τα μόνα Patches που βρέθηκαν απαιτούν την Λειτουργεία Legacy (παλαιού τύπου)";

// MARK: Create Installer Others

"PO-CI-START-TITLE" = "Δημιουργία Εγκαταστάτη του macOS ";
"PO-CI-START-DESCRIPTION" = "Αυτό το εργαλείο σάς επιτρέπει να δημιουργήσετε ένα patched USB εγκατάστασης (τύπου Patched Sur) για την εγκατάσταση του macOS Big Sur, παρόμοια με τον τρόπο που κάνει η εφαρμογή προεγκατάστασης, με μερικές όμως διαφορές. Αυτό μπορεί σίγουρα να χρησιμοποιηθεί σε περίπτωση που αντιμετωπίσετε πρόβλημα αργότερα με το patcher. Σημειώστε ότι μπορείτε να εγκαταστήσετε ένα Recovery Partition που είναι αρκετά παρόμοιο με αυτό το USB, ωστόσο προς το παρόν δεν μπορεί να επανεγκαταστήσει το macOS αφού δεν υπάρχει WiFi στην λειτουργεία Recovery (ανάκτηση). Επίσης να σημειωθεί ότι αν χρησιμοποιείται αυτό το εργαλείο για να κάνετε ενημέρωση, υπάρχει και πιο εύκολος τρόπος, που είναι η εφαρμογή για μετά την εγκατάσταση (post-install app).";
"PO-CI-FINISHED-TITLE" = "Τέλος Δημιουργίας Εγκαταστάτη του macOS.";
"PO-CI-FINSIHED-DESCRIPTION" = "Αυτός ο εγκαταστάτης μπορεί πλέον να χρησιμοποιηθεί για ό,τι θελήσετε εσείς. Έχει γίνει πλήρες patch, ακριβώς όπως θα ήταν και αν κάνατε χρήση της εφαρμογής για πριν την εγκατάσταση (pre-install app). Περιέχει τον εγκαταστάτη του macOS (ελπίζω να το ξέρετε), ένα πλήρες περιβάλλον λειτουργίας επαναφοράς (recovery mode), και βεβαίως το Patched Sur για να κάνετε patch τα kext.";

// MARK: About This Mac

"PO-AMM-MODEL" = "Μοντέλο";
"PO-AMM-PROCESSOR" = "Επεξεργαστής";
"PO-AMM-GRAPHICS" = "Γραφικά";
"PO-AMM-MEMORY" = "Μνήμη";
"PO-AMM-BACK" = "Πίσω στην Αρχική";
"PO-AMM-UPDATE" = "Ενημέρωση Λογισμικού";
"PO-AMM-VERSION" = "Έκδοση";

// MARK: Update Status

"PO-UP-CHECKING" = "Έλεγχος για Ενημερώσεις";
"PO-UP-CHECK-FAILED" = "Αποτυχία Ελέγχου για Ενημερώσεις";
"PO-UP-CHECK-FAILED-1" = "Αυτό μάλλον σημαίνει οτι το WiFi σας δεν λειτορυγεί σωστά, ή οι server που μας φιλοξενούν στο GitHub δεν λειτουργούν. Δεν είναι όμως μεγάλο πρόβλημα αυτό, αφού μπορείτε να κάνετε ενημέρωση του macOS χειροκίνητα με την εφαρμογή προεγκατάστασης (pre-install app), ή να κάνετε ενημέρωση το ίδιο το patcher κατεβάζωντας την νεότερη έκδοση της εφαρμογής απο την σελίδα του Patched Sur στο GitHub.";
"PO-UP-TITLE-PATCHER" = "Ενημέρωση του Patcher";
"PO-UP-TITLE-MACOS" = "Ενημέρωση του macOS";

"PO-UP-USING-TRACK" = "Χρησιμοποιείτε";
// Imagine that this is like a sentence. First you see the above phrase, then Release or Beta, then the next text.
// So this would read, "You are using the Release update track"
"PO-UP-USING-TRACK-2" = "την Beta έκδοση για ενημέρωση.";
"PO-UP-BETA-DESCRIPTION" = "Αυτές οι ενημερώσεις μπορεί να είναι ασταθείς και δεν συνιστώνται για καθημερινή χρήση.";
"PO-UP-RELEASE-DESCRIPTION" = "Αυτές οι ενημερώσεις είναι πιο σταθερές και είναι η προεπιλογή.";
"PO-UP-IS-AVALIBLE" = "Μία ενημέρωση είναι διαθέσιμη!";
"RELEASED" = "Έχει Κυκλοφορήσει";
"BUILD" = "Έκδοση";
"PO-UP-VIEW-OTHER" = "Προβολή Άλλων Εκδόσεων";
"PO-UP-START-TITLE" = "Έναρξη της ενημέρωσης του macOS";
"PO-UP-START-DESCRIPTION" = "Για να πραγματοποιήσετε την ενημέρωση, το patcher θα κατεβάσει πρώτα τα νεότερα patch και την νεότερη έκδοση του macOS κατευθείαν από την Apple, και μετά η λειτουργία ενημέρωσης της Apple θα αρχίσει χωρίς τον έλεγχο συμβατότητας.";
"PO-UP-NOTES-TITLE" = "Προβολή των νεότερων Σημειώσεων Κυκλοφορίας";
"PO-UP-NOTES-DESCRIPTION" = "Δείτε τι είναι νέο στο macOS πριν πραγματοποιήσετε την ενημέρωση. Ευχαριστώ τον Mr. Macintosh (ή μερικές φορές Apple/9to5Mac) που παρέχει αυτές τις σημειώσεις.";
"PO-UP-NO-UPDATES" = "Καμία ενημέρωση διαθέσιμη.";
"PO-UP-YOU-ON" = "Τώρα είστε στην έκδοση XX.YY.ZZ.";
"PO-UP-NOTIF-TITLE" = "Διαμορφώστε τις Ειδοποιήσεις για τις Ενημερώσεις";
"PO-UP-NOTIF-DESCRIPTION" = "Λάβετε ειδοποιήσεις για ενημερώσεις του macOS και του patcher.";

"PO-UP-NOTIF-TITLE-2" = "Ενημέρωση Ειδοποιήσεων";
// In case you don't know, /n means line down. So if I wrote Hello\nWorld, it would show up as:
// Hello
// World
"PO-UP-NOTIF-DESCRIPTION-2" = "Αφού ο Mac σας δεν υποστηρίζεται, η Ενημέρωση Λογισμικού (στις Προτιμήσεις Συστήματος) ποτέ δεν θα μπορέσει να σας δώσει νέες ενημερώσεις για το macOS, διότι δεν μπορεί να βρει κάτι που να υποστηρίζει τον Mac σας. Παρ’όλα αυτά, το Patched Sur μπορεί να προσφέρει αυτή την λειτουργία από μόνο του, δίνοντας σας και ειδοποιήσεις αν το επιθυμείτε .\n\nΛήψη Ειδοποιήσεων Για:";
"NO" = "Όχι";
"YES" = "Ναι";
"CONFIRM" = "Επιβεβαίωση";
"PO-NOTIF-SETUP-DONE" = "Ρυθμίστηκαν Οι Ειδοποιήσεις!";
"PO-NOTIF-SETUP-DONE-2" = "Το Patched Sur θα σας ειδοποιήσει ορθώς για τις νεες ενημερώσεις με βάση τις προτημήσεις σας.";
"PO-NOTIF-SETUP-PERMS" = "Το Patched Sur χρειάζεται άδεια για να στέλνει ειδοποιήσεις.";
"PO-NOTIF-SETUP-PERMS-2" = "Πριν μπορέσει το patcher να σας στείλει ειδοποιήσεις για τις νέες ενημερώσεις, θα χρειαστεί άδεια.";
"PO-NOTIF-SETUP-ALMOST" = "Σχεδόν Τελειώσατε!";
"PO-NOTIF-SETUP-ALMOST-2" = "Για να τελειώσει η ρύθμιση των ειδοποιήσεων, το Patched Sur πρέπει να φτιάξει ένα daemon του χρήστη που θα ελέγχει ανά καιρούς. Για να το ρυθμίσετε, το patcher χρειάζεται άδεια root, όπου θα χρειαστεί να βάλετε τον κωδικό σας και τελειώσατε!";
"PO-NOTIF-SETUP-DENY" = "Το Patched Sur δεν μπορεί να στείλει ειδοποιήσεις";
"PO-NOTIF-SETUP-DENY-2" = "Πιθανότατα αρνηθήκατε την άδεια του Patched Sur να στέλνει ειδοποιήσεις. Αν θέλετε το Patched Surνα στέλνει ειδοποιήσεις, ανοίξτε τις Προτιμήσεις Συστήματος> Ειδοποιήσεις > Patched Sur και επιτρέψτε τις ειδοποιήσεις.";
"PO-NOTIF-SETUP-FAILED" = "Αποτυχία Διαμόρφωσης του Daemon";

"PO-UP-COMPAT-FAIL-SIP" = "Αποτυχία Ελέγχου Κατάστασης SIP";
"PO-UP-COMPAT-FAIL-SIP-2" = "Το Patched Sur απέτυχε να ελέξει την κατάσταση του SIP σας, κάτι που θα έπρεπε να είναι απίθανο.";
"PO-UP-COMPAT-SIP-ON" = "Το SIP φαίνεται να είναι ενεργό";
"PO-UP-COMPAT-SIP-ON-2" = "Αφού ο εγκαταστάτης ελέγχει για να δεί αν η ενημέρωση είναι συμβατή με τον Mac σας, το Patched Sur πρέπει να εισάγει ενα dylib σε αυτή έτσι ώστε ο εγκαταστάτης να μην ενδιαφέρεται αν υπάρχει ασυμβατότητα. Παρ’όλα αυτά, η διαδικασία μπορεί να γίνει μόνο με το SIP απενεργοποιημένο, έτσι το Patched Sur απαιτεί την απενεργοποίηση του πριν συνεχίσετε. Για να το απενεργοποιήσετε:

1. Αρχίστε στην Λειτουργία Επαναφοράς (Recovery) (⌘R κατά την εκκίνηση του υπολογιστή)
2. Ανοίξτε το Terminal που βρίσκετε στο μενού Utilities.
3. Γράψτε: csrutil disable και πατήστε enter.
4. Πατήστε enter και επανεκκινήστε τον υπολογιστή σας, και έπειτα αρχίστε πάλι το Patched Sur.";
"PO-UP-COMPAT-LV-ON" = "Η Library Validation (Επικύρωση Βιβλιοθήκης) είναι ενεργοποιημένη";
"PO-UP-COMPAT-LV-ON-2" = "Η Library Validation (Επικύρωση Βιβλιοθήκης) αποτρέπει το Patched Sur από το να εισάγει κώδικα στον εγκαταστάτη του macOS και από το να προσπερνά τον έλεγχο συμβατότητας. Αν θέλετε να ενημερώσετε το macOS, πρέπει πρώτα να απενεργοποιήσετε την Library Validation (Επικύρωση Βιβλιοθήκης).";

"SKIP" = "Προσπέραση";
"PO-UP-APP-FAILED" = "Η Λήψη Απέτυχε";
"PO-UP-APP-START" = "Κατεβάστε την Ενημέρωση";
"DOWNLOADING" = "Λήψη";

// MARK: Update Chooser

"PO-UP-CHOOSE-TITLE" = "Επιλογή Ενημέρωσης";
"PO-UP-CHOOSE-FAILED" = "Ένα σφάλμα προέκυψε κατά την εύρεση ενημερώσεων.";
"PO-UP-CHOOSE-PRE" = "Αυτή η έκδοση του macOS έχει ήδη ληφθεί:";
"PO-UP-CHOOSE-CAN" = "Μπορείται να κατεβάσετε αυτές τις εκδόσεις του macOS:";
"PO-UP-CHOOSE-DELETE" = "Σίγουρα θέλετε να διαγράψετε τον υπάρχων εγκαταστάτη?";
"PO-UP-CHOOSE-DELETE-2" = "Παρ’ότι θα εκοικονομήσετε12.2 GB χώρου, είναι χρήσιμος για γρήγορη επανεγκατάσταση του macOS.";
"DELETE" = "Διαγραφή";
"UPDATE" = "Ενημέρωση";
"REINSTALL" = "Επανεγκατάσταση";
"UNEXPECTED-ERROR" = "Ένα Απροσδόκητο Πρόβλημα Προέκυψε";
"PO-UP-CHOOSE-EXACT-PATH" = "Αυτό το αρχείο λείπει και το πλήρες patch δεν μπορεί να καθοριστεί. Δεν μπορείτε να χρησιμοποιήσετε τον υπάρχων εγκαταστάτη προς το παρόν.";
"PO-UP-CHOOSE-DOWNLOAD" = "Λήψη Εγκαταστάτη του macOS";
"PO-UP-CHOOSE-DOWNLOAD-1" = "Μπορείτε να κάνετε ενημέρωση σε αυτή την έκδοση του macOS, αλλά μπορείτε και να την κατεβάσετε με το κουμπί που πατήσατε. Αυτή η ειδοποίηση είναι εδώ απλά για να σας ενημερώσει. (Απλά θα ανοίξει τον περιηγητή σας για το ίντερνετ και θα κατεβάσει τον εγκαταστάτη, τίποτα σπουδαίο.)";
"PO-UP-CHOOSE-DOWNLOAD-2" = "Δεν μπορείτε να κάνετε \"ενημέρωση\" σε παλιότερη έκδοση του macOS, αλλά μπορείτε να κατεβάσετε τον εγκαταστάτη αν τον θέλετε για κάτι. (Απλά θα ανοίξει τον περιηγητή σας για το ίντερνετ και θα κατεβάσει τον εγκαταστάτη, τίποτα σπουδαίο.)";
"PO-UP-CHOOSE-DOWNLOAD-TIP" = "Μπορείτε επίσης να κατεβάσετε το InstallAssistant.pkg αν θέλετε.";
"PO-UP-CHOOSE-DOWNLOAD-TIP-2" = "Δεν μπορείτε να κάνετε ενημέρωση σε παλιότερη έκδοση του macOS, αλλά μπορείτε να κατεβάσετε τον εγκαταστάτη αν τον θέλετε.";
"DOWNLOAD" = "Λήψη";

// MARK: Download Patches/macOS

"DOWNLOAD-PATCH-MACOS" = "Λήψη των Patches και του macOS";
"DOWNLOADED-PATCHES" = "Λήψη των Patches";
"PO-UP-DPM-DESCRIPTION" = "Τα patches επιτρέπουν την χρήση υλισμικού όπως το WiFi και επιτρέπουν στο patcher να παρακάμψει κώδικα του εγκαταστάτη, ώστε ο Mac σας να παραμείνει πλήρος λειτουργικός. Γίνεται λήψη του macOS κατευθείαν απο την Apple, σε ορφή αρχείου InstallAssistant.pkg. Έτσι μπορείτε να εξάγετε την εφαρμογή του εγκαταστάτη και να αρχίσετε την εγκατάσταση του macOS. (Μερικές φορές δεν λειτουργεί η μπάρα προόδου, αλλά η λήψη πάντα συνεχίζεται.)";
"DOWNLOADING-MACOS" = "Λήψη του macOS";

// MARK: Starting OS Installer

"PO-UP-SOI-TITLE" = "Έτοιμο για Ενημέρωση!";
"PO-UP-SOI-DESCRIPTION" = "Τωρα, το Patched Sur θα τελειώσει την προετοιμασία για την ενημέρωση και θα αρχίσει την λειτουργία ενημέρωσης του macOS. Μετά από αρκετή ώρα, το macOS θα τελειώσει την εγκατάσταση και θα μπορέσετε να κάνετε patch των kext. Αυτό θα πάρει αρκετή ώρα! Όπως και η αναμονή για την ενημέρωση στις Προτιμήσεις Συστήματος, αυτή δεν είναι και η πιο γρήγορη διαδικασία.";
"PO-UP-SOI-PREPARING" = "Προετοιμασία για Ενημέρωση";

// MARK: Recovery Patch

"PO-IR-SUBTITLE" = "Κάπως Χρήσιμο";
"DISCLAMIER" = "DISCLAIMER";
"PO-IR-DISCLAIM" = "Αυτό δεν είναι κάτι στο οποίο πρέπει να βασίζεστε 100%. Είναι κυρίως η καλύτερη προσπάθεια μας για τώρα. Έχω δοκιμάσει να κάνω την τέλεια λειτουργία επαναφοράς, κάτι που δεν δούλεψε, κυρίως επειδή το υλικολογισμικό του Mac σας αγνοεί αρχεία που δεν έχουν λόγο ύπαρξης. Αν αυτά τα αρχεία δεν αγνοούνταν, δεν θα έγραφα αυτό το μήνυμα. Μπορείτε όμως να κάνετε τα εξής με την λειτουργία επαναφοράς: Διαχείρηση αξιών NVRAM (όπως την κατάσταση του SIP και boot-args), να χρησιμοποιήσετε το Disk Utility, να σερφάρετε το διαδίκτυο (Μάλλον?), και να κάνετε unpatch/patch των kexts (και μάλλον άλλα πράγματα).
Συστήνω να φτιάξετε ένα USB εγκαταστάτη και να το κρατήσετε.
Δεν μπορείτε με αυτό να επανεγκαταστήσετε το macOS.";
"PO-IR-SIP-ON" = "Το SIP είναι Ενεργοποιημένο";
"PO-IR-SIP-ON-DESCRIPTION" = "Το patch επαναφοράς δεν μπορεί να εγκατσταθεί με το SIP  ενεργοποιημένο λόγω προστασίας του συστήματος αρχείων. Φαινομενικά, η απενεργοποίηση του SIP γίνετε μονο μέσα από την λειτουργία επαναφοράς.\n\nΑν όμως έχετε ακόμα τον USB εγκαταστάτη, τότε ίσως μπορέσετε να αρχίσετε στο EFI Boot του. Αν αυτό δεν λειτουργήσει, δοκιμάστε την διαδικτυακή λειτουργία επαναφοράς (CMD-OPTION-R κατά την εκκίνηση) από την οποία θα μπορείτε να το κάνετε.";
"PO-IR-PATCHING" = "Patch της Επαναφοράς";
"PO-IR-PATCHING-DESCRIPTION" = "Η Λειτουργία Επαναφοράς του macOS γίνετε patched στον Mac σας. Αυτή η διαδικασία έχει δύο μέρη, πρώτα είναι η λήψη απαραίτητων αρχείων, και δεύτερων η εγκατάσταση τους. Είναι απλό και γρήγορο. Μόλις τελειώσει, η λειτουργία επαναφοράς του macOS θα ξεκλειδωθεί. Αν έχετε πολλαπλές διαχωρίσεις στον δίσκο σας, λειτουργία επαναφοράς του δίσκου εκκίνησης θα επιλεχθεί (πιθανότατα) αντί για άλλες λειτουργίες επαναφοράς.";
"PO-IR-DOWNLOAD-RECOVERY" = "Λήψη Λειτουργία Επαναφοράς";
"PO-IR-DONE" = "Τέλος του Patching της Λειτουργίας Επαναφοράς!";
"GO-HOME" = "Επιστροφή στην Αρχική";

// MARK: Three v1.0.0 (102)

// Friends in Settings
// Yes I'm adding this lol - duke4e advertised Patched Sur so I have to get him back and then I decided to add macOSicons.com because I like them. Maybe I'll have more friends later.
"PO-ST-FRIENDS" = "Φίλοι του Patched Sur";
"PO-ST-FRIENDS-WIDGY" = "Το Widgy είναι μια καταπληκτική εφαρμογή που σας επιτρέπει να φτιάξτε δικά σας widget για το macOS και το iOS! Με αυτή την εφαρμογή μπορείτε να γεμίζετε την συσκευή σας με το περιεχόμενο σας, με ό,τι στοίχηση θέλετε, ταιριάζοντας το με την Αρχική σας Οθόνη/Επιφάνια Εργασίας. Πολύ κούλ, ε?";
"PO-ST-FRIENDS-ICONS" = "Το macOSicons.com είναι μία ιστοσελίδα γεμάτη με πάνω απο 5,000 διαφορετικά εικονίδια για το macOS Big Sur. Μπορείτε να βρείτε εικονίδια για να αντικαταστήσετε αυτά που δεν ακολουθούν το στυλ του Big Sur, ή να αντικαταστήσετε εικονίδια εφ’όσον δεν σας αρέσει η αρχική τους εκδοχή.";

// MARK: Patch Kexts Configuration

"PO-PK-CONFIGURE" = "Εξελιγμένη Διαμόρφωση";
"PO-PK-CONFIG-WARN" = "Προσοχή: Οι εξελιγμένες διαμορφώσεις θα πρέπει να χρησιμοποιούνται μόνο αν γνωρίζετε καλά τι κάνετε! Προσέξτε να μην ενεργοποιήσετε patches που δεν είναι απαραίτητα.";
// This will come right before a button that toggles between "Patch Kexts" and "Unpatch Kexts"
"PO-PK-CONFIG-MODE" = "Λειτουργία:";
"PO-PK-CONFIG-UNPATCH" = "Όλα τα kext patches θα απεγκατασταθούν και το σύστημα θα επαναφερθεί στην καταστασή προ των patches. Το WiFi και άλλες λειτουργίες δεν θα δουλεύουν, κάτι το οποίο δεν μπορεί να διαμορφωθεί. Αυτό μπορεί να καταστρέψει την συλλογή του kernel του συστήματος, που θα οδηγήσει ή σε έναν Mac με διαρκής πανικούς του kernel ή στην ανικανότητα να γίνει ξανά patch των kext, οπότε είναι συνήθως πιο ασφαλές να επανεγκαταστήσετε το macOS, παρα να κάνετε unpatch.";
"ENABLED" = "Ενεργοποιημένη";
"DISABLED" = "Απενεργοποιημένη";

// MARK: Boot.plist Settings

"PO-ST-BOOT" = "Patch του Boot.plist";
"PO-ST-BOOT-DONE" = "Ήδη έγινε Patch του Boot.plist";
"PO-ST-BOOT-DESCRIPTION" = "Με το patching του com.apple.Boot.plist μπορείτε να κάνετε επαναφορά την NVRAM στον Mac σας χωρίς την χρήση USB εγκαταστάτη και του EFI Boot. Μετά, θα πρέπει να επαναφέρετε την NVRAM (Το Patched Sur θα βοηθήσει) αφού είναι προτημώτερο να έχετε αυτή την αξία. Θα πρέπει να κάνετε patch αυτό το plist κάθε φορά που θα κάνετε ενημέρωση το macOS.";
"PO-ST-BOOT-ONGOING" = "Γίνετε Patch του Boot.plist";
"PO-ST-BOOT-NONE" = "Δεν βρέθηκαν συμβατά patch. Ίσως δεν έχετε κατεβάσει την τελευταία έκδοση των patch, που είναι απαραίτητα για να γίνει patch του boot.plist.  Χρησημποιήστε την 'Ενημέρωση Εφεδρικών Patches' για να ενημερώσετε τα patch, και δοκιμάστε ξανά.";

// MARK: Volume Selection

"PRE-VOL-INCOMPAT" = "Προβολή Ασύμβατων Δίσκων";
"PRE-VOL-INCOMPAT-TITLE" = "Ασύμβατοι Δίσκοι";
"PRE-VOL-INCOMPAT-NODATA" = "Δεν μπορούν να βρεθούν πληροφορίες για τον δίσκο, αυτό μπορεί να είναι πρόβλημα του patcher.";
"PRE-VOL-INCOMPAT-INTERNAL" = "Εσωτερικός δίσκος, χρησιμοποιήστε εξωτερικό USB.";
"PRE-VOL-INCOMPAT-IMAGE" = "Οι εικόνες δίσκου δεν μπορούν να χρησιμοποιηθούν για εκκίνηση, χρησιμοποιήστε εξωτερικό USB.";
// For these next two, I suggest checking Disk Utility for the proper terms for GUID Partition Map and MacOS Extended (Journaled).
"PRE-VOL-INCOMPAT-GUID" = "Δεν έχει γίνει επαναφορά με βάση το GUID Partition Map";
"PRE-VOL-INCOMPAT-SYNTH" = "Σύνθετος (APFS) τόμος, χρησιμοποιήστε MacOS Extended (Journaled)";

// MARK: NVRAM Reset Wanring

"PO-NV-POPUP-TITLE" = "Απαραίτητη αξία NVRAM Λείπει";
"PO-NV-POPUP-DESCRIPTION" = "Η αξία -no_compat_check boot-arg λείπει. Παρ’ότι το Patched Sur σας προστάτευσε απο το μεγαλύτερο πρόβλημα που μπορούσε να προκληθεί από αυτό, μπορεί να προκληθούν περεταίρω προβλήματα.";
"PO-NV-POPUP-START" = "Δείτε Οδηγίες";
"PO-NV-POPUP-DESCRIPTION-TWO" = "Εκκίνηση του Patched Sur (η εφαρμογή μετεγκατάστασης (post-install app), όχι αυτή στο αρχείο dmg) για να μάθετε περισσότερα, και πως να λύσετε το πρόβλημα.";
"PO-NV-POPUP-DESCRIPTION-THREE" = "Επιλέξτε το \"Δείτε Οδηγίες\" για να μάθετε πως να το επαναφέρετε.";

"PO-NV-CHECK-TITLE" = "Έχετε το patched USB εγκαταστάτη σας?";
"PO-NV-CHECK-DESCRIPTION" = "Αν το έχετε ακόμα, τότε η διαδικασία θα είναι πανέυκολη. Συνιστάται να έχετε ενα τέτοιο USB με την νεόερη έκδοση του macOS, και αν θέλετε να φτιάξετε ένα τώρα, πατήστε το κουμπί \"Πίσω\" στην πάνω δεξιά πλευρά της οθόνης, και έπειτα πατήστε \"Δημιουργία Εργαλίου Εγκατάστασης\" και επιστρέψτε όταν το έχετε έτοιμο.";
"PO-NV-CHECK-ONE" = "Έχω Patched USB Εγκαταστάτη.";
"PO-NV-CHECK-TWO" = "Δεν Έχω.";

"PO-NV-ONE-TITLE" = "Επαναφορά Αξίας (με τον εγκαταστάτη)";
"PO-NV-ONE-CONTENT" = "Αφού έχετε εγκαταστάτη USB, αυτή θα είναι μια απλή διαδικασία.\n1. Απενεργοποιήστε τον Mac σας, και ενεργοποιήστε τον πάλι κρατώντας πατημένο το πλήκτρο option.\n2. Σιγουρευτείτε ότι ο εγκαταστάτης USB είναι συνδεμένος, και επιλέξτε τον μωβ δίσκο EFI Boot.\n3. Ο Mac σας θα απενεργοποιηθεί κατευθείαν καο το μόνο που έχετε να κάνετε είναι να τον ενεργοποιήσετε ξανά, και τέλος!";

"PO-NV-TWO-TITLE" = "Επαναφορά Αξίας (χωρίς τον εγκαταστάτη)";
"PO-NV-TWO-CONTENT" = "Αφού δεν έχετε εγκαταστάτη USB, αυτό θα είναι λίγο πιο δύσκολο, αλλά ακόμα απλό. Αν θέλετε μπορείτε να σημειώσετε τις οδηγίες αφού δεν θα έχετε το Patched Sur για βοήθεια.\n\n1. Απενεργοποιήστε τον Mac σας, και ενεργοποιήστε τον πάλι κρατώντας πατημένα τα πλήκτρα CMD-OPTION-R (ακόμα και αν έχετε ήδη εγκαταστήσει την λειτουργία επαναφοράς (Recovery Mode), θα χρειαστείτε την διαδικτυακή λειτουργία επαναφοράς (Internet Recovery)).\n2. Συνδεθείτε στο WiFi σας και εκκινείστε τον Mac σας.\n3. Πατήστε το \"Utilities\" στην γραμμή μενού και επιλέξτε το Terminal.\n4. Γράψτε 'nvram boot-args=-no_compat_check' και πατήστε enter.\n5. Επανεκκινείστε τον Mac σας, και είστε έτοιμοι. ";

"PO-NV-BAR-TITLE" = "Πρόβλημα NVRAM";
"PO-NV-BAR-SUBTITLE" = "Ας το διορθώσουμε.";

"PO-NV-NOUP-TITLE" = "Αποτυχία Ενημέρωσης Χωρίς Την Απαραίτητη Αξία NVRAM";
"PO-NV-NOUP-CONTENT" = "Η ενημέρωση του macOS αφαιρεί το patch boot.plist που επιτρέπει στο Patched Sur να εκκινήσει τον Mac σας χωρίς το  -no_compat_check. Προς το παρόν λείπει αυτή η αξία, άρα η ενημέρωση θα απέτρεπε την εκκίνηση του Mac σας. Μόλις γίνει επαναφορά της αξίας, θα μπορείτε να πραγματοποιήσετε την ενημέρωση. Για να την επαναφέρετε, πατήστε το κόκκινο κουμπί στο κάτω μέρος του παραθύρου.";
